cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFAAxM.svd
        <!-- REGISTER "SCIS0" -->
        <register>
          <name>SCIS0</name>
          <description>Scan Conversion Input Selection Register 0</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AN7" -->
            <field>
              <name>AN7</name>
              <description>Bit7 of SCIS0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN6" -->
            <field>
              <name>AN6</name>
              <description>Bit6 of SCIS0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN5" -->
            <field>
              <name>AN5</name>
              <description>Bit5 of SCIS0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN4" -->
            <field>
              <name>AN4</name>
              <description>Bit4 of SCIS0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN3" -->
            <field>
              <name>AN3</name>
              <description>Bit3 of SCIS0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN2" -->
            <field>
              <name>AN2</name>
              <description>Bit2 of SCIS0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN1" -->
            <field>
              <name>AN1</name>
              <description>Bit1 of SCIS0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AN0" -->
            <field>
              <name>AN0</name>
              <description>Bit0 of SCIS0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFNS" -->
        <register>
          <name>PFNS</name>
          <description>Priority Conversion FIFO Stage Count Setup Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test bits</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PFS" -->
            <field>
              <name>PFS</name>
              <description>Priority conversion FIFO stage count setting bits </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCCR" -->
        <register>
          <name>PCCR</name>
          <description>Priority Conversion Control Register</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEMP" -->
            <field>
              <name>PEMP</name>
              <description>Priority conversion FIFO empty bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PFUL" -->
            <field>
              <name>PFUL</name>
              <description>Priority conversion FIFO full bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "POVR" -->
            <field>
              <name>POVR</name>
              <description>Priority conversion overrun flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PFCLR" -->
            <field>
              <name>PFCLR</name>
              <description>Priority conversion FIFO clear bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ESCE" -->
            <field>
              <name>ESCE</name>
              <description>External trigger analog input selection bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEEN" -->
            <field>
              <name>PEEN</name>
              <description>Priority conversion external start enable bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PHEN" -->
            <field>
              <name>PHEN</name>
              <description>Priority conversion timer start enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSTR" -->
            <field>
              <name>PSTR</name>
              <description>Priority conversion start bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCFD" -->
        <register>
          <name>PCFD</name>
          <description>Priority Conversion FIFO Data Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF0171F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Priority conversion result </description>
              <lsb>20</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INVL" -->
            <field>
              <name>INVL</name>
              <description>A/D conversion result disable bit </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description>Scan conversion start factor</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Conversion input channel bits </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
